StartMilandr/MDR_Pack_v6/SVD_Files/RST/MDR1986VE3_RST.svd
<?xml version="1.0" encoding="utf-8"?>

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" >
  <vendor>Milandr.</vendor>                                       <!-- device vendor name -->

  <vendorID>Milandr</vendorID>                                    <!-- device vendor short name -->
  <!--#BE1-->  
  <!--name>MDR1986BE1_RST</name>
  <series>ARMCM1</series-->
  <!--#BE3-->  
  <name>MDR1986VE3_RST</name>
  <series>ARMCM1</series>
  <!--#BE9x -->
  <!--name>MDR1986BE9x_RST</name>
  <series>ARMCM3</series-->
  <!--#VC1 -->
  <!--name>MDR1901VC1_RST</name>
  <series>ARMCM3</series-->
  <!--#BE4 -->
  <!--name>MDR1986BE4_RST</name>
  <series>ARMCM0</series-->
  <!--#BK214 -->
  <!--name>MDR1986BK214_RST</name>
  <series>ARMCM0</series-->
  <!--#BK234 -->
  <!--name>MDR1986BK234_RST</name>
  <series>ARMCM0</series-->
  
  <version>1.6</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <!--description>ARM 32-bit Cortex-M1 Microcontroller based device, CPU clock up to 144MHz, etc. </description><!--#BE1-->
  <description>ARM 32-bit Cortex-M1 Microcontroller based device, CPU clock up to 80MHz, etc. </description><!--#BE3-->
  <!--description>ARM 32-bit Cortex-M3 Microcontroller based device, CPU clock up to 80MHz, etc. </description--><!--#BE9x-->
  <!--description>ARM 32-bit Cortex-M3 Microcontroller based device with DSP Core, CPU clock up to 100MHz, etc. </description--><!--#VC1-->  
  <!--description>ARM 32-bit Cortex-M0 Microcontroller based device, CPU clock up to 36MHz, etc. </description--><!--#BE4,#BK214,#BK234  -->

  <cpu>                      
    <!--#BE1, #BE3 -->                                     <!-- details about the cpu embedded in the device -->
    <name>CM1</name>
    <revision>r1p0</revision>
    <!--#BE9x,#VC1-->
    <!--name>CM3</name>
    <revision>r2p1</revision-->
    <!--#BE4,#BK214,#BK234-->
    <!--name>CM0</name>
    <revision>r0p0</revision-->

    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <!--nvicPrioBits>3</nvicPrioBits--><!--#BE9x,#VC1-->
    <nvicPrioBits>2</nvicPrioBits><!--#BE1,#BE3,#BE4,#BK214,#BK234-->

    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
                                                                       and register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->

  <!-- Peripherals -->
  <peripherals>
    <!-- RST_CLOCK -->
    <peripheral>
      <name>MDR_RST_CLOCK</name>
      <version>1.0</version>
      <description>CLock Control</description>
      <groupName>RST_CLK</groupName>
      <baseAddress>0x40020000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <!--size>0x38</size--><!--#BE1-->
        <size>0x40</size><!--#BE3-->
        <!--size>0x3C</size--><!--#VC1-->
        <!--size>0x30</size--><!--#BE9x,#BE4,#BK214,#BK234-->
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <!-- CLOCK STATUS -->
        <register>
          <name>CLOCK_STATUS</name>
          <description>Clock Status Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask><!--#BE1,#BE3,#VC1-->
          <!--resetMask>0x00000007</resetMask--><!--#BE9x-->
          <!--resetMask>0x00000006</resetMask><!--#BE4,#BK214,#BK234-->

          <fields>
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <field>
              <name>PLL_USB_RDY</name>
              <description>PLL USP ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__STATUS__PLL_USB_RDY_</headerEnumName>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>PLL not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>PLL ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>          
            <field>
              <name>PLL_CPU_RDY</name>
              <description>PLL CPU ready</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__STATUS__PLL_CPU_RDY_</headerEnumName>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>PLL not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>PLL ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_RDY</name>
              <description>HSE generator ready</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__STATUS__HSE_RDY_</headerEnumName>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>HSE not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>HSE ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--#BE1,#BE3-->
            <field>
              <name>HSE2_RDY</name>
              <description>HSE2 generator ready</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__STATUS__HSE2_RDY_</headerEnumName>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>HSE2 not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>HSE2 ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--#VC1-->
            <!--field>
              <name>PLL_DSP_RDY</name>
              <description>DSP PLL ready</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__PLL_RDY_</headerEnumName>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>PLL not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>PLL ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->

          </fields>
        </register>

