StartMilandr/MDR_Pack_v6/SVD_Files/RST/MDR1986VE3_RST.svd
            <!-- PER_CLOCK.SPI2_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>SPI2_CLK_EN</name>
              <description>SPI2 Clock Enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <!-- PER_CLOCK.PORTA_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>PORTA_CLK_EN</name>
              <description>GPIO PORT_A Clock Enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <!-- PER_CLOCK.PORTB_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>PORTB_CLK_EN</name>
              <description>GPIO PORT_B Clock Enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <!-- PER_CLOCK.PORTC_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>PORTC_CLK_EN</name>
              <description>GPIO PORT_C Clock Enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <!-- PER_CLOCK.PORTD_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>PORTD_CLK_EN</name>
              <description>GPIO PORT_D Clock Enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <!-- PER_CLOCK.PORTE_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>PORTE_CLK_EN</name>
              <description>GPIO PORT_E Clock Enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <!-- PER_CLOCK.ARINC_RX_CLK_EN -->
            <!--#BE1,#BE3-->
            <field derivedFrom="USB_CLK_EN">
              <name>ARINC_RX_CLK_EN</name>
              <description>ARINC_RX Clock Enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <!--#VC1-->
            <!--field derivedFrom="USB_CLK_EN">
              <name>UART3_CLK_EN</name>
              <description>UART3 Clock Enable</description>
              <bitRange>[26:26]</bitRange>
            </field-->

            <!-- PER_CLOCK.BKP_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>BKP_CLK_EN</name>
              <description>Backup Clock Enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <!-- PER_CLOCK.ARINC_TX_CLK_EN -->
            <!--#BE1,#BE3-->
            <field derivedFrom="USB_CLK_EN">
              <name>ARINC_TX_CLK_EN</name>
              <description>ARINC_TX Clock Enable</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <!--#VC1-->
            <!--field derivedFrom="USB_CLK_EN">
              <name>AUC_CLK_EN</name>
              <description>AUC Clock Enable</description>
              <bitRange>[28:28]</bitRange>
            </field-->

            <!-- PER_CLOCK.PORTF_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>PORTF_CLK_EN</name>
              <description>GPIO PORT_F Clock Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <!-- PER_CLOCK.EBC_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>EBC_CLK_EN</name>
              <description>External Bus Clock Enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <!-- PER_CLOCK.SPI3_CLK_EN -->
            <!--#BE1,#BE3-->
            <field derivedFrom="USB_CLK_EN">
              <name>SPI3_CLK_EN</name>
              <description>SPI3 Clock Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <!--#VC1-->
            <!--field derivedFrom="USB_CLK_EN">
              <name>CRYPTO_CLK_EN</name>
              <description>CRYPTO Clock Enable</description>
              <bitRange>[31:31]</bitRange>
            </field-->

            <!-- PER_CLOCK fields end-->
          </fields>
        </register>

        <!-- PER2_CLOCK0x1C-->
        <!--#BE4,#BK214,#BK234-->
        <!--register>
          <name>PER2_CLOCK</name>
          <description>Peripherials Clock Control 2</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x000FFFFF</resetMask><!--#BE4-->
          <!--resetMask>0x0007FDFF</resetMask--><!--#BK214-->
          <!--resetMask>0x000FF3FF</resetMask--><!--#BK234-->
          <!--fields>
            <!-- PER2_CLOCK.SPI1_CLK_EN -->
            <!--field>
              <name>SPI1_CLK_EN</name>
              <description>SPI1 Clock Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PER2__SPI1_CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- PER2_CLOCK.UART1_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>UART1_CLK_EN</name>
              <description>UART1 Clock Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <!-- PER2_CLOCK.UART2_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>UART2_CLK_EN</name>
              <description>UART2 Clock Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <!-- PER2_CLOCK.EEPROM_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>EEPROM_CLK_EN</name>
              <description>EEPROM Clock Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <!-- PER2_CLOCK.RST_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>RST_CLK_EN</name>
              <description>RST Clock Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <!-- PER2_CLOCK.DMA_CLK_EN -->
            <!--#BE4,#BK234-->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>DMA_CLK_EN</name>
              <description>DMA Clock Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <!-- PER2_CLOCK.CMP_CLK_EN -->
            <!--#BE4-->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>CMP_CLK_EN</name>
              <description>CMP Clock Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <!-- PER2_CLOCK.I2C_CLK_EN -->
            <!--#BK214-->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>I2C_CLK_EN</name>
              <description>I2C Clock Enable</description>
              <bitRange>[6:6]</bitRange>
            </field-->

            <!-- PER2_CLOCK.DAC_CLK_EN -->
            <!--#BE4-->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>DAC_CLK_EN</name>
              <description>DAC Clock Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <!-- PER2_CLOCK.LCD_CLK_EN -->
            <!--#BK214-->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>LCD_CLK_EN</name>
              <description>LCD Clock Enable</description>
              <bitRange>[7:7]</bitRange>
            </field-->

            <!-- PER2_CLOCK.ADC_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>ADC_CLK_EN</name>
              <description>ADC Clock Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <!-- PER2_CLOCK.WWDT_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>WWDT_CLK_EN</name>
              <description>WWDT Clock Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <!-- PER2_CLOCK.IWDT_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>IWDT_CLK_EN</name>
              <description>IWDT Clock Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <!-- PER2_CLOCK.PWR_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>PWR_CLK_EN</name>
              <description>Power Clock Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <!-- PER2_CLOCK.BKP_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>BKP_CLK_EN</name>
              <description>Backup Clock Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <!-- PER2_CLOCK.ADCIU_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>ADCIU_CLK_EN</name>
              <description>ADCIU Clock Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <!-- PER2_CLOCK.TIMER1_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>TIMER1_CLK_EN</name>
              <description>TIMER1 Clock Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <!-- PER2_CLOCK.TIMER2_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>TIMER2_CLK_EN</name>
              <description>TIMER2 Clock Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <!-- PER2_CLOCK.PORTA_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>PORTA_CLK_EN</name>
              <description>GPIO PORT_A Clock Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <!-- PER2_CLOCK.PORTB_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>PORTB_CLK_EN</name>
              <description>GPIO PORT_B Clock Enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <!-- PER2_CLOCK.PORTC_CLK_EN -->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>PORTC_CLK_EN</name>
              <description>GPIO PORT_C Clock Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <!-- PER2_CLOCK.CRC_CLK_EN -->
            <!--#BE4,#BK234-->
            <!--field derivedFrom="SPI1_CLK_EN">
              <name>CRC_CLK_EN</name>
              <description>CRC Clock Enable</description>
              <bitRange>[19:19]</bitRange>
            </field>

            <!-- PER2_CLOCK fields end-->
          <!--/fields>
        </register-->


        <!-- CAN_CLOCK -->
        <!--#BE1,#BE3,#BE9x-->
        <register>
          <name>CAN_CLOCK</name>
          <description>CAN's Clock Control</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0300FFFF</resetMask>
          <fields>
            <!-- CAN_CLOCK.CAN1_BRG -->
            <field>
              <name>CAN1_BRG</name>
              <description>HCLK divider to get CAN1_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CAN1__BRG_</headerEnumName>
                <enumeratedValue><name>div1</name><description>div by 1</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>div by 2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>div4</name><description>div by 4</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>div8</name><description>div by 8</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>div16</name><description>div by 16</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>div32</name><description>div by 32</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>div64</name><description>div by 64</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>div128</name><description>div by 128</description><value>7</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- CAN_CLOCK.CAN2_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.CAN_CLOCK.CAN1_BRG">
              <name>CAN2_BRG</name>
              <description>HCLK freq divider to get CAN2_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- CAN_CLOCK.CAN1_CLK_EN -->
            <field>
              <name>CAN1_CLK_EN</name>
              <description>CAN1_CLOCK enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CAN__CAN1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>CAN1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>CAN1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- CAN_CLOCK.CAN2_CLK_EN -->
            <field>
              <name>CAN2_CLK_EN</name>
              <description>CAN2_CLOCK enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CAN__CAN2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>CAN2 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>CAN2 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- CAN_CLOCK fields end-->
          </fields>
        </register>

